; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph2 - mode
	infrared1 - mode
	image0 - mode
	Star12 - direction
	Star3 - direction
	Star8 - direction
	GroundStation5 - direction
	Star10 - direction
	Star9 - direction
	Star14 - direction
	GroundStation7 - direction
	GroundStation13 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	Star2 - direction
	GroundStation11 - direction
	Star0 - direction
	Planet15 - direction
	Phenomenon16 - direction
	Planet17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 thermograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation11)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 infrared1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 GroundStation7)
	(calibration_target instrument2 Star10)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star14)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 Star9)
	(supports instrument4 image0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation7)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation13)
	(supports instrument5 image0)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 GroundStation13)
	(supports instrument6 image0)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star0)
	(calibration_target instrument6 GroundStation11)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
)
(:goal (and
	(have_image Planet15 infrared1)
	(have_image Phenomenon16 thermograph2)
	(have_image Planet17 image0)
	(have_image Phenomenon18 image0)
))

)

; plan
1. (turn_to satellite1 groundstation11 groundstation13)
   deleted: (pointing satellite1 groundstation13)
   added: (pointing satellite1 groundstation11)
   goals met: 0 of 4
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 4
3. (calibrate satellite1 instrument2 groundstation11)
   added: (calibrated instrument2)
   goals met: 0 of 4
4. (turn_to satellite1 planet15 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 planet15)
   goals met: 0 of 4
5. (take_image satellite1 planet15 instrument2 infrared1)
   added: (have_image planet15 infrared1)
   goals met: 1 of 4
6. (turn_to satellite1 phenomenon16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 4
7. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 4
8. (calibrate satellite0 instrument1 star8)
   added: (calibrated instrument1)
   goals met: 1 of 4
9. (take_image satellite1 phenomenon16 instrument2 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 2 of 4
10. (turn_to satellite0 phenomenon18 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon18)
   goals met: 2 of 4
11. (take_image satellite0 phenomenon18 instrument1 image0)
   added: (have_image phenomenon18 image0)
   goals met: 3 of 4
12. (turn_to satellite0 planet17 phenomenon18)
   deleted: (pointing satellite0 phenomenon18)
   added: (pointing satellite0 planet17)
   goals met: 3 of 4
13. (take_image satellite0 planet17 instrument1 image0)
   added: (have_image planet17 image0)
   goals met: 4 of 4
